In [1]:
import pandas as pd

In [13]:
data = {"name":["a","b","c",'d','a','c'],"eng":[8,7,5,8,8,4],"hindi":[2,3,4,5,2,6
                                                                     ]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
4    a    8      2
5    c    4      6

In [17]:
df.drop_duplicates(keep='first',inplace=True)

In [18]:
df

  name  eng  hindi
0    a    8      2
1    b    7      3
2    c    5      4
3    d    8      5
5    c    4      6